Podkova/src/Enums/КатегорииДокументовEDI/КатегорииДокументовEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДокументовEDI</name>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/КатегорииДокументовEDI/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСТаблицейСоответствия

Функция ЗначениеПоИдентификаторуКлиентскогоAPI(Идентификатор) Экспорт 
	
	ТаблицаСоответствий = ТаблицаСтатусовКлиентскогоAPI();
	
	Возврат СоответствиеПоЗначениюСервиса(ТаблицаСоответствий, Идентификатор);
	
КонецФункции

Функция ИдентификаторКлиентскогоAPIПоЗначению(Значение) Экспорт 
	
	ТаблицаСоответствий = ТаблицаСтатусовКлиентскогоAPI();
	
	Возврат СоответствиеПоЗначениюИБ(ТаблицаСоответствий, Значение);
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеТаблицыСоответствия

Функция ТаблицаСтатусовКлиентскогоAPI()
	
	Результат = ТаблицаСоответствийЗначений();
	
	ДобавитьСтрокуСоответствия(Результат, Перечисления.КатегорииДокументовEDI.ПустаяСсылка(), "");
	ДобавитьСтрокуСоответствия(Результат, Перечисления.КатегорииДокументовEDI.Закупка,       "buying");
	ДобавитьСтрокуСоответствия(Результат, Перечисления.КатегорииДокументовEDI.Продажа,       "selling");
	ДобавитьСтрокуСоответствия(Результат, Перечисления.КатегорииДокументовEDI.Доставка,      "delivery");
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуСоответствия(СоответствиеЗначений, ЗначениеИБ, ЗначениеСервиса)
	
	НоваяСтрока = СоответствиеЗначений.Добавить();
	
	НоваяСтрока.ЗначениеСервиса = ЗначениеСервиса;
	НоваяСтрока.ЗначениеИБ = ЗначениеИБ;
	
КонецПроцедуры

Функция ТаблицаСоответствийЗначений()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ЗначениеСервиса");
	Результат.Колонки.Добавить("ЗначениеИБ");
	
	Возврат Результат ;
	
КонецФункции

Функция СоответствиеПоЗначениюСервиса(СоответствиеЗначений, ЗначениеДляПоиска)
	
	Результат = СоответствиеЗначений.Найти(ЗначениеДляПоиска, "ЗначениеСервиса");
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.ЗначениеИБ;
	КонецЕсли;
	
КонецФункции

Функция СоответствиеПоЗначениюИБ(СоответствиеЗначений, ЗначениеДляПоиска)
	
	Результат = СоответствиеЗначений.Найти(ЗначениеДляПоиска, "ЗначениеИБ");
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.ЗначениеСервиса;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
